
# Python의 자료구조
# myDict = {
#      "id" : "memoming",
#      "no" : 4
# }

# print(myDict["id"])
# print(myDict["no"])

# myList = [1,2,2,10,10,3,8,8,3,3,5,5,5,5,5]
# mySet = set(myList)
# print(mySet)
# -----------------------------------------------------------------------------------------------


# List 생성, 추가
# A = [1,2,3,4]
# print(A[-1])

# B = list()
# B.append("일")
# B.append(2)
# print(B)

# A.append(5)
# print(A)
# -----------------------------------------------------------------------------------------------


# List 수정, 삭제
# A = [1,2,2,3,4,5]
# A.remove(2)
# print(A)
# -----------------------------------------------------------------------------------------------

# List.index( ) 사용하기
# A = [1,5,7,6,10]
# print(A.index(8))


# in 사용해보기
# A = [1,5,7,6,10]
# input_num = 5
# if( input_num in A ) :
#     print(A.index(input_num))
# else :
#     print("해당 원소가 리스트안에 없습니다.")

# List.conut 사용해보기
# A = [7,7,2,6,3,5,1,6]
# print(A.count(7))

# List 슬라이싱 사용해보기
# A = [1,2,3,4,5,6,7,8]
# B = A[0:5]
# print(B)
# -----------------------------------------------------------------------------------------------




