
# -----------------------------------------------------------------------------------------------
# 강의에서 사용했던 예제 코드 파일입니다.
# 필요한 부분을 주석 해제 후 실행(F5) 해주세요.
# -----------------------------------------------------------------------------------------------


# str1      = "안녕하세요 메모밍입니다"
# myList    = [1,2,3,4,5,6,0,0,0]

# v2 = str1.endswith("입니다.")     # True or False를 돌려줍니다
# v3 = str1.startswith("메모밍")
# print(str1.strip())

# A = len(myList)
# print(A)
# -----------------------------------------------------------------------------------------------

# open을 이용해서 txt파일 읽어보기 
# fileStream = open("lab02.txt")      #파일스트림을 열고 !
# contents = fileStream.read()
# print(contents)
# fileStream.close()                  #파일스트림을 닫고 !
# print( type(contents) )             #type() 함수로 해당 오브젝트가 어떤 타입인지 확인할 수 있어요
# -----------------------------------------------------------------------------------------------


# 한 줄씩 읽어보기
# fileStream = open("lab02.txt")      #파일스트림을 열고 !
# c1 = fileStream.readline()          #한 줄 읽기
# print(c1)
# c2 = fileStream.readline()          #한 줄 읽기
# print(c2)
# fileStream.close()                  #파일스트림을 닫고 !
# -----------------------------------------------------------------------------------------------


# fileStream = open("lab02.txt")      #파일스트림을 열고 !
# c1 = fileStream.readlines()         #한 줄씩 읽어서 list로 만들어주는 함수 
# print(c1[0].strip())
# fileStream.close()                  #파일스트림을 닫고 !
# -----------------------------------------------------------------------------------------------


# for 반복문
# 1 부터 10 까지 출력 해봅시다 !
# A = [1,2,3,4,5,6,7,8,9,10]
# B = "이번시간은 for 반복문 입니다"
# for i in B :
#     print(i)
# -----------------------------------------------------------------------------------------------


# range( a, b, c)를 사용해보자 !
# A = range(1,11,2)
# for i in A :
#     print(i)
# -----------------------------------------------------------------------------------------------


# 실습예제 1
# fStream = open("ex01.txt")
# num = fStream.read()
# num = num.strip()
# print(int(num)+1)
# fStream.close()
# -----------------------------------------------------------------------------------------------


# 심화예제 1
# fStream = open("ex0_1.txt")
# rlt = 0
# numList = fStream.readlines()
# for str_number in numList :
#     # print(type(str_number))
#     rlt = rlt + int(str_number)
# print(rlt)
# fStream.close()
# -----------------------------------------------------------------------------------------------
















